package ru.gb;

/**
 * 3. Реализуйте метод, принимающий в качестве аргументов два целочисленных массива
 * и возвращающий новый массив, каждый элемент которого равен разности элементов
 * двух входящих массивов в той же ячейке.
 * Если длины массивов не равны, необходимо как-то оповестить пользователя.
 * <p>
 * 4(*). Реализуйте метод, принимающий в качестве аргументов два целочисленных массива
 * и возвращающий новый массив, каждый элемент которого равен частному элементов
 * двух входящих массивов в той же ячейке.
 * Если длины массивов не равны, необходимо как-то оповестить пользователя.
 * <p>
 * Важно: При выполнении метода единственное исключение, которое пользователь
 * может увидеть - RuntimeException, т.е. ваше.
 */

//public class Main {
//    public static void main(String[] args) {
//    }
//}